#include <stdio.h>
int main ()
{
	/*求最大值，最小值及其行列标*/
	int i,j,t,max,min,r1,c1,r2,c2;//控制变量设置
	int a[3][4]={{4,6,10,28},{7,3,9,11},{32,5,4}};
	max=a[0][0];
	min=a[0][0];//设定最值用于比较
	for (i=0;i<3;i++)//循环比较
		for(j=0;j<4;j++){
			if(a[i][j]>max){
				max=a[i][j];
				r1=i; c1=j; //记录行列
			}
			if(a[i][j]<min){
				min=a[i][j];
				r2=i;	c2=j; //记录行列
			}
		}
	printf("最大值:%d,所在行:%d,所在列:%d\n",max,r1,c1);
	printf("最小值:%d,所在行:%d,所在列:%d\n",min,r2,c2);//结果输出
	/*全部数据排序，冒泡法*/
	for(i=0;i<12;i++){//难度在于设置循环变量去访问每一个数据
			for(j=0;j<11;j++){
				if(a[j/4][j%4]>a[(j+1)/4][(j+1)%4]){
					t=a[j/4][j%4];
					a[j/4][j%4]=a[(j+1)/4][(j+1)%4];
					a[(j+1)/4][(j+1)%4]=t;
				} // a[j/(行数+1)][j%(列数)]可以以序号去访问每一个数据
			}
	}
	for(i=0;i<3;i++){
		for(j=0;j<4;j++)
			printf("%5d",a[i][j]);//%5d各单位长度
			printf("\n");
	} //数组输出
    return 0;
}
